# CurtainGridSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridSet Constructor
CurtainGridSet Class See Also
---
Initializes a new instance of the CurtainGridSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurtainGridSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CurtainGridSet()
```

# See Also
CurtainGridSet Class
Autodesk.Revit.DB Namespace